{
    "event_url": "https://www.eventbrite.com/e/physics-force-winter-shows-tickets-27179524690?aff=es2", 
    "location_name": "84 Church Street Se, Minneapolis, MN 55455, United States", 
    "description": "Physics is Fun! We invite you to the 2017 University of Minnesota's Physics Force Winter Shows. These free-of-cost performances will take place at Northrop on the University's campus January 9-13, 2017. The show dates and times (Each show is 60-75 minutes long) Monday 1/9 10:00 am & 1:00pm Tues 1/10 10:00 am & 1:00pm Wed 1/11 10:00am & 1:00 pm Th 1/12 10:00 am, 1:00pm & 7:00pm Fri 1/13 10 am & 1:00pm The shows are free but reservations are required. Reserve as many tickets as you need, but please reserve only if you intend to come. Seats are in high demand. The shows are free but reservations are required. Please reserve on this site. Please cancel your tickets, or notify us of a cancellation by November 15, 2016. The system has a 100 ticket per order maximum. If you need more than 100 tickets please create multiple orders. The same teacher's name can be used for all reservations. Include adults, teachers, and chaperones in your order number. The morning and afternoon shows are allocated to elementary and middle school classes. The Thursday evening show is open to the general public. Some funding is available to help public schools with bus support. If you would like to apply for this funding please follow the link http://www.physics.umn.edu/resources/forms/pfbusing.html. You must apply by November 1, 2016 and you will be notified as to the amount that can be provided for your school before November 15th, 2016. If you will need support for hearing impaired students please use the link http://www.physics.umn.edu/resources/forms/SLI.html Announcing new Rochester shows in May We also want to announce our new spring shows May 10-11, 2017 in Rochester, Minn., including a public show May 11, 7 p.m. Registration is open. To learn more about the physics force and the show please go to http://www.physics.umn.edu/outreach/pforce/ For questions, contact Angie Stehr at 612-301-8303, stehr002@umn.edu", 
    "creator": {
        "id": "1", 
        "email": ""
    }, 
    "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F24172290%2F4067900361%2F1%2Foriginal.jpg?w=1000&rect=0%2C0%2C2160%2C1080&s=0fa00d0f7dfade5adf87e9fb6ae2e8c0", 
    "start_time": "", 
    "social_links": [
        {
            "name": "Facebook", 
            "id": "1"
        }, 
        {
            "name": "Twitter", 
            "id": "2"
        }
    ], 
    "ticket_url": "https://www.eventbrite.com/e/physics-force-winter-shows-tickets-27179524690?aff=es2#tickets", 
    "longitude": -93.23553, 
    "organizer_name": "hysics Force, University of Minnesota", 
    "topic": "", 
    "privacy": "public", 
    "state": "completed", 
    "end_time": "", 
    "latitude": 44.976547, 
    "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F24172290%2F4067900361%2F1%2Foriginal.jpg?w=1000&rect=0%2C0%2C2160%2C1080&s=0fa00d0f7dfade5adf87e9fb6ae2e8c0", 
    "type": "", 
    "id": "27179524690", 
    "name": "Physics Force Winter Shows by Physics Force, University of Minnesota"
}