{
    "event_url": "https://www.eventbrite.com/e/cambria-christmas-market-2016-tickets-21122762752?aff=es2", 
    "location_name": "2905 Burton Drive, Cambria, CA 93428, United States", 
    "description": "Merry Christmas & Welcome to the 2016 Cambria Christmas Market! Join us for the 5th Annual Cambria Christmas Market, a festive, ongoing gathering in the style of Germany's Christmas Markets with nightly entertainment! Gates open at 5:00pm and close at 8:30pm each night of the Market. Please allow at least 1 hour to view the Market and Lights. No entry after 8:30pm so please arrive early. The Market and the Lights close at 9:00pm each night of the Market. Children 5 and Under are free and do not require a ticket. All parking is off-site with free shutles to the event. Please vist http://www.cambriachristmasmarket.com for parking locations. Parking at the Cambria Pines Lodge is reserved for Hotel Guests and limited handicap parking only. There is no street parking near the event. The first shuttle to the event leaves at 4:45pm and the last shuttle to the event is at 8:00pm. The last shutle from the Market leaves the event at 9:15pm. Please be in line for the return shuttle no later than 8:45pm to insure you do not miss it. Strollers are permitted on the shuttles. Pets are not permited on the shuttles or at the Christmas Market. Please check out the events calander below for nightly entertainment or visit our website http://www.cambriachristmasmarket.com . If you are interested in becoming a vendor, entertainer or employee at this years Market, please contact Mike at mikea@moonstonehotels.com or visit our website cambriachristmasmarket.com. There are no refunds or exchanges for purchased tickets. Event tickets are only valid for 1 entry for the date on the ticket. Can not be combined with any other offers.", 
    "creator": {
        "id": "1", 
        "email": ""
    }, 
    "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F18321604%2F164379478747%2F1%2Foriginal.jpg?w=1000&rect=0%2C69%2C900%2C450&s=cc1f2f94a2f41d6bd6d8844b1fb5286b", 
    "start_time": "2016-11-25T17:00:00", 
    "social_links": [
        {
            "name": "Facebook", 
            "id": "1"
        }, 
        {
            "name": "Twitter", 
            "id": "2"
        }
    ], 
    "ticket_url": "https://www.eventbrite.com/e/cambria-christmas-market-2016-tickets-21122762752?aff=es2#tickets", 
    "longitude": -121.08012, 
    "organizer_name": "ambria Christmas Market", 
    "topic": "", 
    "privacy": "public", 
    "state": "completed", 
    "end_time": "2016-12-23T21:00:00", 
    "latitude": 35.558746, 
    "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F18321604%2F164379478747%2F1%2Foriginal.jpg?w=1000&rect=0%2C69%2C900%2C450&s=cc1f2f94a2f41d6bd6d8844b1fb5286b", 
    "type": "", 
    "id": "21122762752", 
    "name": "Cambria Christmas Market 2016 by Cambria Christmas Market"
}