{
    "event_url": "https://www.eventbrite.com.au/e/2017-rainbow-serpent-festival-tickets-25500710311?aff=es2", 
    "location_name": "Jack Smiths Lane, Lexton, VIC 3352, Australia", 
    "description": "Rainbow Serpent Festival has been on a wonderful journey over the last two decades. From a small gathering in a secluded clearing Rainbow has developed into one of the most highly regarded music and arts festivals in the world. These days the epic five day multifaceted explosion of dance, colour, expression and celebration attracts people from all over the planet who converge on Lexton in Western Victoria in January for an unforgettable, unique Australian experience. We would like to extend a warm invitation to come and join us for our 20th Anniversary Celebration! It will come as no surprise we intend for Rainbow 2017 to be a momentous celebration of world class music producers and DJs, beautiful art and sculpture with inspiring speakers and workshops. We will look back at the incredible journey we've all taken together while enjoying an unprecedented weekend of activities, opportunities, moments and memories. With world class décor, roving artistic performances, crazy activities you can’t imagine a more exotic sensory mix. If you’ve never been to the Rainbow Serpent Festival, now is the time to buy a tent and call your friends. The name Rainbow Serpent is distinctly Australian, coming from the Dreamtime creation story told by the traditional owners of the land. Dreamtime stories often vary between aboriginal tribes, however the story of the Rainbow Serpent is special as it is one of the few common to all. To keep informed of announcements and updated line-ups please go to our website at www.rainbowserpent.net", 
    "creator": {
        "id": "1", 
        "email": ""
    }, 
    "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F21924902%2F108354663171%2F1%2Foriginal.jpg?w=1000&rect=0%2C0%2C2160%2C1080&s=64b80f241d41f4fda24061f301842e70", 
    "start_time": "2017-01-26T18:00:00", 
    "social_links": [
        {
            "name": "Facebook", 
            "id": "1"
        }, 
        {
            "name": "Twitter", 
            "id": "2"
        }
    ], 
    "ticket_url": "https://www.eventbrite.com.au/e/2017-rainbow-serpent-festival-tickets-25500710311?aff=es2#tickets", 
    "longitude": 143.47433, 
    "organizer_name": "ainbow Serpent Festival", 
    "topic": "", 
    "privacy": "public", 
    "state": "completed", 
    "end_time": "2017-01-30T19:00:00", 
    "latitude": -37.301086, 
    "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F21924902%2F108354663171%2F1%2Foriginal.jpg?w=1000&rect=0%2C0%2C2160%2C1080&s=64b80f241d41f4fda24061f301842e70", 
    "type": "", 
    "id": "25500710311", 
    "name": "2017 Rainbow Serpent Festival by Rainbow Serpent Festival"
}