{"session": {"identity": {"type": "host", "name": "79.155.137.109", "anonymous": true}}, "data": [{"event_url": "https://www.eventbrite.com/e/sql-saturday-cleveland-precon-adam-machanic-tuning-your-biggest-queries-tickets-29840594020?aff=es2", "location_name": "28500 Clemens Road, Westlake, OH 44145, United States", "description": "Today's database workloads are all about bigger, better, and more: bigger data, better analytics, and more insights. While these improvements can be great for your business users, on the technology side they often translate into large, lumbering queries that monopolize the server and test the patience of even the calmest of analysts. This full-day seminar is specifically designed to help you tune these extra tough queries. The day begins by establishing a solid foundation for reading and understanding how query plans work, and what is and is not important to pay attention to when reading a plan. Next you will learn about plan shaping: types of query rewrites that work, which rewrites are bound to fail, and the various query hints you might want to leverage in especially difficult situations. Real-world application of these techniques will be covered with a discussion around how to understand what kind of plan is ideal given the particulars of a situation, and the introduction of an approach to help you analyze and fix even the biggest query plans. The day concludes with a look at various indexing strategies and patterns--both common and alternative, including a look at the applicability of columnstores in SQL Server 2016 and beyond. You will leave the class armed with an array of tools and ideas to help you tame even the biggest queries in your environment. Outline: Module 1: Query Plans How Query Plans Really Work Data Acquisition Iterators Join Iterators Aggregation and Analysis Iterators Parallel Processing Module 2: Plan Shaping T-SQL Rewrites That Waste Your Time T-SQL Rewrites That Work Query Hints Leveraging Row Goals For Plan Control Understanding Ideal Plan Shape Performance Debugging Complex Plans Module 3: Index Optimization The Levels of Index Understanding How B*Tree Indexes Really Work How to Design Optimal B*Tree Indexes How to Choose Among Indexing Options Columnstores vs. B*Trees Presenter: Adam Machanic Adam Machanic is a Boston-based SQL Server developer, writer, and speaker. He focuses on large-scale data warehouse performance and development, and is author of the award-winning SQL Server monitoring stored procedure, sp_WhoIsActive. Adam has written for numerous web sites and magazines, including SQLblog, Simple Talk, Search SQL Server, SQL Server Professional, CoDe, and VSJ. He has also contributed to several books on SQL Server, including \"T-SQL Querying\" (Microsoft Press, 2015) and \"SQL Server 2008 Internals\" (Microsoft Press, 2009). Adam regularly speaks at conferences and training events on a variety of SQL Server topics. He is a Microsoft Most Valuable Professional (MVP) for SQL Server, a Microsoft Certified IT Professional (MCITP), and an alumnus of the INETA North American Speakers Bureau. A Note from the Organizer: This event is affiliated with SQL Saturday Cleveland 2017, which is also held at Hyland Software on 2/4/17. Please visit our event site at http://www.sqlsaturday.com/595/EventHome.aspx for more information or to register to attend. You do not need to attend SQL Saturday to be able to attend this precon event.", "creator": {"id": "1", "email": ""}, "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F26351152%2F135754592412%2F1%2Foriginal.jpg?w=1000&rect=2%2C0%2C230%2C115&s=6fb7361fc392397a5ac7bfb523fc104b", "start_time": "2017-02-03T08:30:00", "social_links": [{"name": "Facebook", "id": "1"}, {"name": "Twitter", "id": "2"}], "ticket_url": "https://www.eventbrite.com/e/sql-saturday-cleveland-precon-adam-machanic-tuning-your-biggest-queries-tickets-29840594020?aff=es2#tickets", "longitude": -81.93524, "organizer_name": "hio North SQL Server User Group", "topic": "", "privacy": "public", "state": "completed", "end_time": "2017-02-03T16:30:00", "latitude": 41.470905, "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F26351152%2F135754592412%2F1%2Foriginal.jpg?w=1000&rect=2%2C0%2C230%2C115&s=6fb7361fc392397a5ac7bfb523fc104b", "type": "", "id": "29840594020", "name": "SQL Saturday Cleveland Precon: Adam Machanic - Tuning Your Biggest Queries by Ohio North SQL Server User Group"}, {"organizer_link": "https://www.eventbrite.com/e/sql-saturday-cleveland-precon-adam-machanic-tuning-your-biggest-queries-tickets-29840594020?aff=es2#listing-organizer", "organizer_name": "hio North SQL Server User Group", "organizer_profile_link": "", "organizer_contact_info": "https://www.eventbrite.com/e/sql-saturday-cleveland-precon-adam-machanic-tuning-your-biggest-queries-tickets-29840594020?aff=es2#lightbox_contact"}, {"microlocations": []}, {"customForms": []}, {"sessionTypes": []}, {"sessions": []}, {"sponsors": []}, {"speakers": []}, {"tracks": []}], "metadata": {"count": 9}}