{
    "event_url": "https://www.eventbrite.com/e/womens-march-on-washington-official-tickets-29428287801?aff=es2", 
    "location_name": "Washington, DC, United States", 
    "description": "On January 21, 2017 we will unite in Washington, DC for the Women’s March on Washington. We stand together in solidarity with our partners and children for the protection of our rights, our safety, our health, and our families -- recognizing that our vibrant and diverse communities are the strength of our country. The rhetoric of the past election cycle has insulted, demonized, and threatened many of us--women, immigrants of all statuses, those with diverse religious faiths particularly Muslim, people who identify as LGBTQIA, Native and Indigenous people, Black and Brown people, people with disabilities, the economically impoverished and survivors of sexual assault. We are confronted with the question of how to move forward in the face of national and international concern and fear. In the spirit of democracy and honoring the champions of human rights, dignity, and justice who have come before us, we join in diversity to show our presence in numbers too great to ignore. The Women’s March on Washington will send a bold message to our new administration on their first day in office, and to the world that women's rights are human rights. We stand together, recognizing that defending the most marginalized among us is defending all of us. We support the advocacy and resistance movements that reflect our multiple and intersecting identities. We call on all defenders of human rights to join us. This march is the first step towards unifying our communities, grounded in new relationships, to create change from the grassroots level up. We will not rest until women have parity and equity at all levels of leadership in society. We work peacefully while recognizing there is no true peace without justice and equity for all. HEAR OUR VOICE. FAQs I'M NOT A WOMAN, AM I INVITED? Yes, the Women’s March on Washington is for any person, regardless of gender or gender identity, who believes women’s rights are human rights. WILL IT BE SAFE? CAN I BRING MY KIDS? The WMW has a team of experienced and professional national organizers working to ensure that every safety protocol is followed. We will release specific details on how to stay safe during your time in Washington as we draw closer to the date. The decision to bring your children is a personal one. IS THIS MARCH INCLUSIVE FOR WOMEN OF COLOR? The WMW is an evolving effort and it was founded by white women. These women recognized the need to be truly inclusive, and brought together the national co-chairs, now reflected a balanced representation. The teams of organizers and volunteers working for the march, by extension, are now more fully reflective of the diversity of our nation and this trend will continue as we build steam. I WANT MY ORGANIZATION TO BE INVOLVED. HOW CAN WE JOIN THE MOBILIZATION? Please contact Carmen Perez at carmen@womensmarch.com to discuss how your organization can join and support the Women’s March on Washington. I CAN'T ATTEND IN PERSON, BUT I WANT TO SUPPORT THE EFFORT. HOW CAN I HELP? For those who cannot travel to Washington, D.C., but who wish to organize or participate in a march in their home area, please find your state page on Facebook and reach out to your state admins. You can do this by visiting the national Facebook page and reviewing the list to find your state. For those who cannot attend but wish to support the effort financially, please donate on this page or stay in touch reagrding out official fundraising page, which will be released shortly. Please stay tuned and thank you for your support. WILL THE WMW BE ACCESSIBLE FOR PEOPLE WITH DISABILITIES? Each state group operates independently of the national organizing effort. We strongly encourage state organizers to follow our lead in making the WMW fully accessible, however, we make no claim or representation on behalf of state and local groups. The WMW is committed to ensuring that the national convening is accessible to people with disabilities. We are working with volunteers to ensure translation for people with hearing disabilities and are committed to including access points for people with disabilities that require the use of a wheelchair. There will be an area with seating to accommodate people with disabilities, elderly people and pregnant women. WHAT IS THE CURRENT STATUS WITH THE PERMIT FOR THE MARCH? There has been a lot of talk and speculation regarding the permits and the permitting process. We want to ensure that everyone understands it is a process, meaning a request of this nature and size takes time and coordination of agencies before the permit is approved. Additionally, the permit goes through several updates as the event solidifies. After a week of internal planning and submission of the initial permits, Janaye Ingram and other members of the organizing committee had their first meeting on November 23, 2016 with National Park Service, the Metropolitan Police Department, Capitol Police and Homeland Security to coordinate the original permits. The result of that meeting is a unified rally and march plan. Because this is an ongoing effort, details of the meeting will not be shared until they are finalized. We will continue to meet with the agencies leading up to the event to ensure the safety of everyone attending and to meet the goals that we have for this convening. As we continue to finalize things like bus staging, metro access and other logistical details, we will provide updated information to all who wish to participate. We know that some things in this process seem to move quickly and others will seem like they aren’t moving fast enough, but in order to accommodate the number of people that we anticipate, we want to do this right. That means that we need your patience as we work to get you the most accurate information possible. The Women's March on Washington is happening and we look forward to meeting you there! Visit our website at www.womensmarch.com for more updates!", 
    "creator": {
        "id": "1", 
        "email": ""
    }, 
    "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F25954393%2F194339366129%2F1%2Foriginal.jpg?w=1000&rect=262%2C0%2C1524%2C762&s=0ded6612773a7d800e10d7172b1688a5", 
    "start_time": "2017-01-21T10:00:00", 
    "social_links": [
        {
            "name": "Facebook", 
            "id": "1"
        }, 
        {
            "name": "Twitter", 
            "id": "2"
        }
    ], 
    "ticket_url": "https://www.eventbrite.com/e/womens-march-on-washington-official-tickets-29428287801?aff=es2#tickets", 
    "longitude": -77.03687, 
    "organizer_name": "omen's March on Washington- National Organizers", 
    "topic": "", 
    "privacy": "public", 
    "state": "completed", 
    "end_time": "2017-01-21T17:00:00", 
    "latitude": 38.907192, 
    "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F25954393%2F194339366129%2F1%2Foriginal.jpg?w=1000&rect=262%2C0%2C1524%2C762&s=0ded6612773a7d800e10d7172b1688a5", 
    "type": "", 
    "id": "29428287801", 
    "name": "Women's March on Washington [OFFICIAL] by Women's March on Washington- National Organizers"
}