{
    "name": "Super Megafest Comic Con Spring Spectacular 2017",
    "location_name": "181 Boston Post Rd West, Marlborough, MA 01752",
    "social_links": [
        {
            "name": "Email Us",
            "link": "https://supermegafest.ticketleap.com/spring2017/contact",
            "id": 1
        }
    ],
    "longitude": "-71.5930676",
    "background_image": "img/background.jpg",
    "topic": "",
    "description": "THE BEST SUPER MEGAFEST COMIC CON YET! - 75,000- square feet of Spectacular! The New England Super Megafest Comic Con is here! Hollywood & Comic Book fun comes back to New England! Comics, Movies, Super Heroes, Music, Wrestling and Intergalactic Fun come together in Marlborough at the Super Megafest, New England's premiere Comic Celebrity Pop Culture Fan Fest!The Super Megafest Comic Con Spring Spectacular takes placeFriday, April 7th from 4pm. to 9pmSaturday, April 8th from 10:30am to 6pmSunday, April 9th from 10:30am to 5pmat the ROYAL PLAZA TRADE CONVENTION CENTER located at 181 Boston Post Rd. West, Marlborough, MA 01752.Comic, Movie and TV fans will be thrilled with the rare appearances of celebrity movie and TV guests and amazing comics artists to be announced!The stars will be signing autographs and doing Q & A sessions with fans throughout the day. Professional photos with most celebrities will be available on site!The Super Megafest features the best exhibitors on the East Coast with one of the largest selections of comics, toys, videos, non-sports cards and memorabilia from TV, Movies, and Rock & Roll that you will ever find.Other attractions include an amazing Costume Contest (including a children's category), stunning Movie Cars, mischievous Pirate madness, movie prop reproductions and much more! After hours, enjoy a multitude of shadowcast movie performances and parties, including the CosCLUB Dance Party, ensuring the event has something for all ages!For more info log onto www.supermegafest.com",
    "privacy": "public",
    "ticket_url": "https://supermegafest.ticketleap.com/spring2017/dates",
    "end_time": "2017-04-09T17:00:00",
    "type": "",
    "creator": {
        "id": "1",
        "email": ""
    },
    "latitude": "42.3409704",
    "organizer_name": "New England Super Megafest",
    "start_time": "2017-04-07T16:00:00",
    "state": "Unfinished"
}