{"session": {"identity": {"type": "host", "name": "59.180.23.12", "anonymous": true}}, "data": [{"event_url": "https://www.eventbrite.com/e/python-for-junos-tickets-30229183301?aff=es2", "location_name": "", "description": "COURSE OVERVIEW The Python for JUNOS Bootcamp is a 2-day course that introduces Python programming concepts as applied Juniper Network’s products. This course has a primary objective of providing students with the skills needed to use Python as a mechanism to program Juniper devices. The course is instructor led with a focus on teaching students how to create Python code to program or manage Juniper network devices and consists of 50% lecture and 50% practical component. OBJECTIVES After successfully completing this course, you should be able to perform the following: • Understand the basics of Python • Understand how to communicate with Network Devices • Identify the building blocks of Python: Data Structures, Comparisons, Looping, etc • Identify the different modules and packages that comprise Python • Understand Object-oriented programming • Understand Data storage and retrieval INTENDED AUDIENCE The Python for JUNOS Bootcamp is an intermediate to advanced level course. The course content is aimed at prospective or current operators of Juniper devices, and that have a background and familiarity with network switching and routing. These operators include network engineers, administrators, support personnel, and reseller support personnel. PREREQUISITES Beginner to intermediate knowledge of JUNOS and layer2/3 networking concepts. COURSE AGENDA Day 1 00 –Introduction • Introductions • Course Content 01 - Python Introduction Why Python for JUNOS? Setup Data Basics Strings Printing Code Blocks Reading Data Execution Code examples and walkthroughs Lab 02 - Python and Network Device Communication PyEZ Paramiko Pexpect Code examples and walkthroughs Lab 03 - Python Data Structures Data structures Nested data structures Code examples and walkthroughs Lab 04 - Comparisons Comparing data If statement Else statement Advanced Code examples and walkthroughs Lab 05 - Loops for loop while loop Exiting loops Nested loops Code examples and walkthroughs Lab Day 2 06 - Functions Reasons for functions Function basics Passing parameters to a function Returning values to the caller Code examples and walkthroughs Lab 07 - Program Structure Modules Packages Code examples and walkthroughs Lab 08 - Object-oriented programming Classes and Objects Inheritance Code examples and walkthroughs Lab 09 - File storage Reading and writing of YAML files Reading and writing of JavaScript Object Notation (JSON) files Reading and writing of comma separated values (CSV) files SQL database using sqlite3 Code examples and walkthroughs Lab", "privacy": "public", "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F26618254%2F150760881237%2F1%2Foriginal.jpg?w=1000&rect=0%2C0%2C2160%2C1080&s=75967a1c172aad80b823e842214586b6", "type": "", "start_time": "2017-02-02T09:00:00", "social_links": [{"name": "Facebook", "id": "1"}, {"name": "Twitter", "id": "2"}], "ticket_url": "https://www.eventbrite.com/e/python-for-junos-tickets-30229183301?aff=es2#tickets", "organizer_name": "DN Essentials", "topic": "", "state": "completed", "end_time": "2017-02-03T17:00:00", "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F26618254%2F150760881237%2F1%2Foriginal.jpg?w=1000&rect=0%2C0%2C2160%2C1080&s=75967a1c172aad80b823e842214586b6", "creator": {"id": "1", "email": ""}, "id": "30229183301", "name": "Python for JUNOS by SDN Essentials"}, {"organizer_link": "https://www.eventbrite.com/e/python-for-junos-tickets-30229183301?aff=es2#listing-organizer", "organizer_name": "DN Essentials", "organizer_profile_link": "", "organizer_contact_info": "https://www.eventbrite.com/e/python-for-junos-tickets-30229183301?aff=es2#lightbox_contact"}, {"microlocations": []}, {"customForms": []}, {"sessionTypes": []}, {"sessions": []}, {"sponsors": []}, {"speakers": []}, {"tracks": []}], "metadata": {"count": 9}}