{"session": {"identity": {"type": "host", "name": "59.180.23.12", "anonymous": true}}, "data": [{"event_url": "https://www.eventbrite.com.au/e/python-for-network-engineering-sydney-march-2017-tickets-28907715756?aff=es2", "location_name": "5 Elizabeth Street, Sydney CBD, New South Wales 2000, Australia", "description": "A specialist 3 day course in Python for Network Engineers. Dates: 22 - 24 March 2017 Prerequisites: The course requires some familiarity with programming concepts. Overview: By the end of the course, you will have all the knowledge you need to write and interact with Python code for a variety of purposes, with a particular focus on string manipulation and search. You understand Python’s syntax and know what's available with Python. You will have had experience using several important modules in the Python standard library, including for regular expression matching, as well as interacting with log files and searching for errors. You will also have had experience in consuming and creating simple web APIs and reporting interfaces and learned about some best practices in Python for testing, debugging, and maintainability. Format: The course is a mixture of hands-on exercises and instruction from experts. Places are strictly limited to ensure there is plenty of hands-on help available for the exercises. Day 1: Python Basics Day 1 covers how to use Python for general programming tasks, including tips and tricks for making this easy. The syllabus is as follows: Why use Python? What’s possible? Python syntax and concepts: an introduction through examples Variables, values and operators Conditions Loops Functions Essential data structures: strings and lists Input and output of text data (including CSV files) String methods Day 2: Further Python essentials Day 2 introduces further important concepts for real-world programming in Python, including how to write code for maintainability, robustness, and efficiency. The syllabus is as follows: Further important data structures: dictionaries and sets Classes and objects Modules and packages Raising and handling exceptions Tour of the amazing standard library: Logging Handling dates and times Introduction to string matching with regular expressions Day 3: Real-world programming in Python Day 3 introduces how to consume and create web APIs and the basics of creating web interfaces using Python. It also shows some “best practices” of software development using Python. Consuming web APIs with the requests package Creating web APIs with Flask Creating easy web-based reporting interfaces with Flask Practical debugging strategies Unit testing with py.test Best practices for writing maintainable code; coding style We also encourage you to bring your own data sets to the course where relevant.", "creator": {"id": "1", "email": ""}, "background_url": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F25408187%2F167077046459%2F1%2Foriginal.jpg?w=1000&rect=0%2C672%2C5616%2C2808&s=388a1987b5927ac18d5dd0386427c529", "start_time": "2017-03-22T09:00:00", "social_links": [{"name": "Facebook", "id": "1"}, {"name": "Twitter", "id": "2"}], "ticket_url": "https://www.eventbrite.com.au/e/python-for-network-engineering-sydney-march-2017-tickets-28907715756?aff=es2#tickets", "longitude": 151.2103, "organizer_name": "ython Charmers", "topic": "", "privacy": "public", "state": "completed", "end_time": "2017-03-24T17:00:00", "latitude": -33.86666, "logo": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F25408187%2F167077046459%2F1%2Foriginal.jpg?w=1000&rect=0%2C672%2C5616%2C2808&s=388a1987b5927ac18d5dd0386427c529", "type": "", "id": "28907715756", "name": "Python for Network Engineering - Sydney - March 2017 by Python Charmers"}, {"organizer_link": "https://www.eventbrite.com.au/e/python-for-network-engineering-sydney-march-2017-tickets-28907715756?aff=es2#listing-organizer", "organizer_name": "ython Charmers", "organizer_profile_link": "", "organizer_contact_info": "https://www.eventbrite.com.au/e/python-for-network-engineering-sydney-march-2017-tickets-28907715756?aff=es2#lightbox_contact"}, {"microlocations": []}, {"customForms": []}, {"sessionTypes": []}, {"sessions": []}, {"sponsors": []}, {"speakers": []}, {"tracks": []}], "metadata": {"count": 9}}