{
    "name": "Music of DREAM Concert",
    "location_name": "1961 Irvine Blvd, Tustin, CA 92780",
    "social_links": [
        {
            "name": "Email Us",
            "link": "https://musicofdream.ticketleap.com/musicofdream/contact",
            "id": 1
        }
    ],
    "longitude": "-117.798002",
    "background_image": "img/background.jpg",
    "topic": "",
    "description": "Music of DREAM by composer Dan McGurn returns with an expanded ensemble & more original compositions. In his previous sold out concert, people commented how moved they were by Dan's compositions. We hope to see you there! Sydney Mariano on violinBobby Nafarrete on pianoDan McGurn on trumpetSpecial guests To Be AnnouncedSearch is now underway for our next vocal STARDan McGurn is a composer & trumpet player in Orange County. He has extensive performance experience including a three-year world tour with Ray Charles as his jazz soloist. He has also worked with a variety of well-known performers such as Sammy Davis Jr., Julie Andrews, Jose Feliciano, Michel Legrand, Marvin Hamlisch, Donna Summer, Dionne Warwick, Johnny Mathis, Richard Harris in Camelot & many others. He also performed with Demetri & Silverware Big Band, Tom Kubis, Bob Florence, Frankie Capp and Les Brown. His theatre performances include the Long Beach Civic Light Opera, Pasadena Civic Light Opera & Pantages. He played principal trumpet with the Pacific Symphony Orchestra and has also recorded music for movies. He began performing at age 17 in professional venues from Carnegie Hall to the London Palladium and has toured in over 20 countries. He studied composition and performance at Berklee College of Music and has written over 300 pieces of music.Sydney Grace Mariano began studying violin at the age of six in Singapore before moving with her family to Irvine, CA.  Sydney is now a sophomore at USC Thornton School of music. She won the Grand Prize at the 10th Annual Satori International Strings Solo competition and the 2014 Pacific Symphony Youth Orchestra (PSYO) Concerto competition. She has performed in over 90 concerts as well as solo performances for PSYO at the Segerstrom Performing Arts Center.Bobby Nafarrete Is a professional composer, arranger, orchestrator, keyboardist, music director, and MIDI/computer music producer. He received a BM in Commercial Composition and Arranging at CSUF, and MFA in Musical Theatre. He has worked with NBC - Macy's Thanksgiving Day Parade - Bob Hope Tribute, Coca-Cola/McDonald's - Sea World San Diego - Cirque de La Mer (soundtrack), The South Coast Repertory Theatre. He currently is the Director of Music Ministry at St. Hedwig Catholic Church in Los Alamitos.",
    "privacy": "public",
    "ticket_url": "https://musicofdream.ticketleap.com/musicofdream/dates",
    "end_time": "2017-05-13T21:00:00",
    "type": "",
    "creator": {
        "id": "1",
        "email": ""
    },
    "latitude": "33.74069",
    "organizer_name": "Ramirez, McGurn & Associates, Inc.",
    "start_time": "2017-05-13T19:00:00",
    "state": "Unfinished"
}