{
    "name": "Seasons (2017)",
    "location_name": "401 I St, Arcata, CA 95521",
    "social_links": [
        {
            "name": "Email Us",
            "link": "https://miniplex.ticketleap.com/seasons/contact",
            "id": 1
        }
    ],
    "longitude": "-124.089549",
    "background_image": "img/background.jpg",
    "topic": "",
    "description": "From the directors of \"WINGED MIGRATION,\" this awe-inspiring nature doc tells a millennia-spanning history of Europe through the eyes of animals, beginning with the last ice age.\"Some of the most breathtaking nature photography this side of BBC's 'Planet Earth.'\" -Variety\"The close proximity of the cameras, and the use of long takes, allows us to witness the animals' nuanced physical gestures and facial expressions, creating a level of intimacy with the audience that builds to an emotional crescendo.\" -SlantAfter traveling the world alongside migrating birds (Winged Migration) and diving the oceans with whales and manta rays (Oceans), Jacques Perrin and Jacques Cluzaud return to more familiar ground: the lush green forests and megafauna that emerged across Europe following the last Ice Age. Winter had gone on for 80,000 years when in a relatively short period of time the ice retreated, the landscape metamorphosed, the cycle of seasons was established, and the beasts occupied their new kingdom. It was only later that man arrived to share this habitat, first tentatively as migratory hunter/gatherers, then making inroads in the forest as settled agriculturalists, and later more dramatically via industry and warfare. With its exceptional footage of animals in the wild, Seasons is the awe-inspiring and thought-provoking tale of the long and tumultuous shared history that inextricably binds humankind with the natural world. Rated PG. 97 mins. French with English subtitles.***Please note that NO OUTSIDE DRINKS OR FOOD are allowed inside Richards' Goat Tavern for legal reasons and violators of this rule may be banned from the theatre permanently. Cocktails, non-alcoholic beverages, popcorn, and cookies are available at the bar. If you are interested in one of our hot food specials, please show up at least 30 minutes early to finish it in the bar area, as hot food is not allowed inside the dark theatre for your safety. Thank you, see you at the movies!",
    "privacy": "public",
    "ticket_url": "https://miniplex.ticketleap.com/seasons/dates",
    "end_time": "2017-01-31T19:00:00",
    "type": "",
    "creator": {
        "id": "1",
        "email": ""
    },
    "latitude": "40.8655754",
    "organizer_name": "The Miniplex",
    "start_time": "2017-01-02T17:00:00",
    "state": "Unfinished"
}
