{
    "name": "Hunter Gatherer (2017)",
    "location_name": "401 I St, Arcata, CA 95521",
    "social_links": [
        {
            "name": "Email Us",
            "link": "https://miniplex.ticketleap.com/hunter-gatherer/contact",
            "id": 1
        }
    ],
    "longitude": "-124.089549",
    "background_image": "img/background.jpg",
    "topic": "",
    "description": "After a 3-year stint in prison, an unreasonably optimistic middle-aged man (THE WIRE's Andre Royo) returns to his stagnant neighborhood to win back his girlfriend, only to find that she and his family have done what they always wanted to do - forget he exists. Not rated. 90 mins. \"Warmly eccentric little indie that's amusing, authentic and works against expectation.\" - Los Angeles Times\"Doesn't look or feel like many movies being made right now...It never veers into a brutal crime plot to juice things up (as many similarly-set movies tend to do), nor does it feel compelled to make a statement about anything other than its eccentric characters' relationships to each other and the wider world.\" - rogerebert.com\"Features a welcome starring role for Andre Royo (\"The Wire\"), whose performance as a wily hustler trying to stay one step ahead of possible ruin sets the tone for this odd, occasionally mystifying but undeniably singular and imaginative work.\" -Variety***Please note that NO OUTSIDE DRINKS OR FOOD are allowed inside Richards' Goat Tavern for legal reasons and violators of this rule may be banned from the theatre permanently. Cocktails, non-alcoholic beverages, popcorn, and cookies are available at the bar. If you are interested in one of our hot food specials, please show up at least 30 minutes early to finish it in the bar area, as hot food is not allowed inside the dark theatre for your safety. Thank you, see you at the movies!",
    "privacy": "public",
    "ticket_url": "https://miniplex.ticketleap.com/hunter-gatherer/dates",
    "end_time": "2017-01-30T18:30:00",
    "type": "",
    "creator": {
        "id": "1",
        "email": ""
    },
    "latitude": "40.8655754",
    "organizer_name": "The Miniplex",
    "start_time": "2017-01-12T17:00:00",
    "state": "Unfinished"
}